OpenDTEF-v1912/tutorials/compressible/rhoSimpleFoam/squareBend/system/isentropicTotalPressure
isentropicPressure
{
    type            pressure;
    libs            (fieldFunctionObjects);
    enabled         yes;
    writeControl    writeTime;
    mode            isentropic;
    result          isentropicP;
}
